server/Spec/backend-stress-test.yml
config:
  target: "http://localhost:5005"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 1000
      name: Sustained Stress Load
  payload:
    path: "id.csv"
    fields:
      - "id"
    order: "sequence"
scenarios:
  # One example scenario, can add more api requests here
  - name: "Get photos by Room Number"
    flow:
      - get:
          url: "/rooms/{{ id }}/getPhotosByRoomId"